[
  {"setup": "Why did the scarecrow become a motivational speaker?", "punchline": "Because he was outstanding in his field!"},
  {"setup": "What do you call a bear with no socks on?", "punchline": "Barefoot!"},
  {"setup": "Why can't basketball players go on vacation?", "punchline": "Because they would get called for traveling!"},
  {"setup": "What do you call a dinosaur that takes care of its teeth?", "punchline": "A Flossiraptor!"},
  {"setup": "Why did the tomato turn red?", "punchline": "Because it saw the salad dressing!"},
  {"setup": "What do you call cheese that isn't yours?", "punchline": "Nacho cheese!"},
  {"setup": "Why did the math book look sad?", "punchline": "Because it had too many problems!"},
  {"setup": "What do you call a fake noodle?", "punchline": "An impasta!"},
  {"setup": "Why don't eggs tell jokes?", "punchline": "They'd crack up!"},
  {"setup": "What do you call a sleeping bull?", "punchline": "A bulldozer!"},
  {"setup": "Why did the computer go to art school?", "punchline": "Because it wanted to learn how to draw a better 'byte'!"},
  {"setup": "What do you call a cold dog?", "punchline": "A chili dog!"},
  {"setup": "Why did the bicycle fall over?", "punchline": "Because it was drunk!"},
  {"setup": "What do you call a snake that works for the government?", "punchline": "A civil serpent!"},
  {"setup": "Why was the belt arrested?", "punchline": "Because it was holding up a pair of pants!"},
  {"setup": "What do you call a fish with no eyes?", "punchline": "A fsh!"},
  {"setup": "Why did the golfer bring two pairs of pants?", "punchline": "In case he got a hole in one!"},
  {"setup": "What do you call a lazy kangaroo?", "punchline": "A pouch potato!"},
  {"setup": "Why did the astronaut break up with his girlfriend?", "punchline": "Because he needed space!"},
  {"setup": "What do you call a robot that takes the longest route?", "punchline": "R2-Detour!"},
  {"setup": "Why did the cookie go to the hospital?", "punchline": "Because it felt crumby!"},
  {"setup": "What do you call a deer with no eyes?", "punchline": "No eye deer!"},
  {"setup": "Why did the banana go to the doctor?", "punchline": "It wasn't peeling well!"},
  {"setup": "What do you call a snowman with a six-pack?", "punchline": "An abdominal snowman!"},
  {"setup": "Why did the chicken join a band?", "punchline": "Because it had the drumsticks!"},
  {"setup": "What do you call a bear that sings?", "punchline": "A gummy bear!"},
  {"setup": "Why did the frog take the bus?", "punchline": "Because it was too hopped up to drive!"},
  {"setup": "What do you call a cat that loves to sing?", "punchline": "A meow-sician!"},
  {"setup": "Why did the skeleton go to the dance?", "punchline": "Because it had all the right moves!"},
  {"setup": "What do you call a pirate with two eyes?", "punchline": "A rookie!"},
  {"setup": "Why did the orange stop rolling?", "punchline": "It ran out of juice!"},
  {"setup": "What do you call a dog magician?", "punchline": "A Labracadabrador!"},
  {"setup": "Why did the pencil go to jail?", "punchline": "Because it couldn't stop breaking the law!"},
  {"setup": "What do you call a tree that sings?", "punchline": "A rock 'n' roll spruce!"},
  {"setup": "Why did the clock go to therapy?", "punchline": "It had too many ticks!"},
  {"setup": "What do you call a sheep with no legs?", "punchline": "A cloud!"},
  {"setup": "Why did the tomato join the band?", "punchline": "Because it wanted to be a little saucy!"},
  {"setup": "What do you call a monkey that loves to drink?", "punchline": "A drunk monkey!"},
  {"setup": "Why did the strawberry get embarrassed?", "punchline": "Because it was in a jam!"},
  {"setup": "What do you call a horse that lives next door?", "punchline": "A neigh-bor!"},
  {"setup": "Why did the cow become an artist?", "punchline": "Because it was great at drawing a mooo-ve!"},
  {"setup": "What do you call a fish that wears a crown?", "punchline": "King Neptune!"},
  {"setup": "Why did the book go to therapy?", "punchline": "It had an identity crisis!"},
  {"setup": "What do you call a lazy dinosaur?", "punchline": "A couch-asaurus!"},
  {"setup": "Why did the lemon stop?", "punchline": "It ran out of zest!"},
  {"setup": "What do you call a turtle that takes selfies?", "punchline": "A snapper!"},
  {"setup": "Why did the bread go to school?", "punchline": "To improve its loaf-esteem!"},
  {"setup": "What do you call a pig that does karate?", "punchline": "A pork chop!"},
  {"setup": "Why did the apple go to the gym?", "punchline": "To get a little 'cider'!"},
  {"setup": "What do you call a bee that can't make up its mind?", "punchline": "A maybee!"},
  {"text": "I told my computer I needed a break, and it replied, 'Ctrl+Alt+Delete your stress!'"},
  {"text": "Parallel lines have so much in common, but they'll never meet."},
  {"text": "I used to be a baker, but I couldn't make enough dough."},
  {"text": "I'm reading a book on anti-gravity; it's impossible to put down!"},
  {"text": "I told my wife she was drawing her eyebrows too high; she looked surprised."},
  {"text": "I'm on a seafood diet: I see food, and I eat it!"},
  {"text": "I tried to catch fog, but I mist."},
  {"text": "I told my friend she drew her eyeliner too thick; she said it was her bold look!"},
  {"text": "I used to play piano by ear, but now I use my hands."},
  {"text": "I'm friends with all my clocks; we always have a great time!"},
  {"text": "I told my dog he’s a good boy, and now he’s wagging his tail off!"},
  {"text": "I got a job at a bakery because I kneaded the cash."},
  {"text": "I tried to write a joke about time travel, but it hasn't landed yet."},
  {"text": "I wanted to be a motivational speaker, but I kept losing my train of thought."},
  {"text": "My cat just walked across my keyboard; now my essay is pawsitively ruined!"},
  {"text": "I told my lamp it was too bright; it dimmed its enthusiasm."},
  {"text": "I tried to organize a space party, but the aliens were too spaced out."},
  {"text": "I asked my mirror for advice, but it just reflected my bad decisions."},
  {"text": "I bought a new vacuum; it really sucks at everything!"},
  {"text": "I told my fridge to chill, and now it’s giving me the cold shoulder."},
  {"text": "I tried to join a choir, but they said I was too pitchy."},
  {"text": "I asked my phone for directions, but it just kept ringing off the hook."},
  {"text": "I told my chair to take a seat, but it just stood there."},
  {"text": "I tried to befriend a cloud, but it kept raining on my parade."},
  {"text": "My calendar is so full, it’s practically dated!"},
  {"text": "I told my pencil it was pointless, and it broke under pressure."},
  {"text": "I tried to cook dinner, but my kitchen said, 'You're out of thyme!'"},
  {"text": "I asked my shoes for a walk, but they were too tied up."},
  {"text": "I told my pillow I needed rest, and it said, 'Dream on!'"},
  {"text": "I tried to learn coding, but I kept getting stuck in a loop."},
  {"text": "I told my coffee it was brewed perfectly, and it perked up!"},
  {"text": "I asked my plant for growth advice, but it just leafed me alone."},
  {"text": "I tried to write a novel, but I kept getting writer’s block."},
  {"text": "I told my car it was tired, and it replied, 'I'm exhausted!'"},
  {"text": "I asked my clock for a second, and it ticked me off."},
  {"text": "I tried to dance with my broom, but it swept me off my feet."},
  {"text": "I told my socks they were a great pair, and they got all warm and fuzzy."},
  {"text": "I asked my hat to cover for me, but it just sat there."},
  {"text": "I tried to tell a chemistry joke, but there was no reaction."},
  {"text": "I told my ladder it was a step up, and it climbed with confidence."},
  {"text": "I asked my wallet for cash, but it was empty-handed."},
  {"text": "I tried to tell a light bulb joke, but it wasn’t very bright."},
  {"text": "I told my dog he was fetching, and he brought me a stick."},
  {"text": "I asked my window for a view, but it just gave me a pane."},
  {"text": "I tried to make a pun about wind, but it blew away."},
  {"text": "I told my guitar it was out of tune, and it strung me along."},
  {"text": "I asked my door to open up, but it stayed closed-off."},
  {"text": "I tried to tell a math joke, but it didn’t add up."},
  {"text": "I told my candle it was lit, and it glowed with pride."},
  {"text": "I asked my fan to cool it, and it spun out of control."}
]
